###############################################################################
# Created by write_sdc
# Thu Dec 25 14:55:57 2025
###############################################################################
current_design syncfifo
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 100.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[14]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[15]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[16]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[17]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[18]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[19]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[20]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[21]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[22]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[23]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[24]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[25]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[26]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[27]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[28]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[29]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[30]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[31]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {re}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rstn}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {we}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[10]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[11]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[12]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[13]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[14]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[15]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[16]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[17]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[18]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[19]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[20]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[21]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[22]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[23]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[24]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[25]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[26]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[27]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[28]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[29]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[30]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[31]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[4]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[5]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[6]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[7]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[8]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[9]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {empty}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {full}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {empty}]
set_load -pin_load 0.0334 [get_ports {full}]
set_load -pin_load 0.0334 [get_ports {dout[31]}]
set_load -pin_load 0.0334 [get_ports {dout[30]}]
set_load -pin_load 0.0334 [get_ports {dout[29]}]
set_load -pin_load 0.0334 [get_ports {dout[28]}]
set_load -pin_load 0.0334 [get_ports {dout[27]}]
set_load -pin_load 0.0334 [get_ports {dout[26]}]
set_load -pin_load 0.0334 [get_ports {dout[25]}]
set_load -pin_load 0.0334 [get_ports {dout[24]}]
set_load -pin_load 0.0334 [get_ports {dout[23]}]
set_load -pin_load 0.0334 [get_ports {dout[22]}]
set_load -pin_load 0.0334 [get_ports {dout[21]}]
set_load -pin_load 0.0334 [get_ports {dout[20]}]
set_load -pin_load 0.0334 [get_ports {dout[19]}]
set_load -pin_load 0.0334 [get_ports {dout[18]}]
set_load -pin_load 0.0334 [get_ports {dout[17]}]
set_load -pin_load 0.0334 [get_ports {dout[16]}]
set_load -pin_load 0.0334 [get_ports {dout[15]}]
set_load -pin_load 0.0334 [get_ports {dout[14]}]
set_load -pin_load 0.0334 [get_ports {dout[13]}]
set_load -pin_load 0.0334 [get_ports {dout[12]}]
set_load -pin_load 0.0334 [get_ports {dout[11]}]
set_load -pin_load 0.0334 [get_ports {dout[10]}]
set_load -pin_load 0.0334 [get_ports {dout[9]}]
set_load -pin_load 0.0334 [get_ports {dout[8]}]
set_load -pin_load 0.0334 [get_ports {dout[7]}]
set_load -pin_load 0.0334 [get_ports {dout[6]}]
set_load -pin_load 0.0334 [get_ports {dout[5]}]
set_load -pin_load 0.0334 [get_ports {dout[4]}]
set_load -pin_load 0.0334 [get_ports {dout[3]}]
set_load -pin_load 0.0334 [get_ports {dout[2]}]
set_load -pin_load 0.0334 [get_ports {dout[1]}]
set_load -pin_load 0.0334 [get_ports {dout[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {re}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rstn}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {we}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
